// --створити масив з:
// - з 5 числових значень 
    // let number = [1, 5, 6, 8, 45];
// // - з 5 стічкових значень
    // let string = ["akt", "git", "php", 'js', "html"];
// // - з 5 значень стрічкового, числового та 
// // булевого типу
    let StringNumBool = ["React" ,"Angular", "NextJS", 1, 45, false,true, {admin:"Volan"}, ["addaas"]]
// // - та вивести його в консоль
// console.log(number);
// console.log(string);
// console.log(StringNumBool);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
    // let arra = [];
    // arra [0] = "Star";
    // arra [1] = "JS";
    // arra [2] = "java";
    // arra [3] = "nextJS";
    // // console.log(arra);

    
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i < 10; i++) {
//    document.write(`<div>${StringNumBool[i]}</div>`);
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i < 10; i++) {
//     document.write(`<div> ${[i]}.  ${StringNumBool[i]}</div>`);
// }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//  let i = 0;
//  while (i < 10) {
//      document.write(`<h1>${[i]}.  ${StringNumBool[i]}</h1>`)
//      i++
//  }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
    // let tenNumber = [255, 254, 253, 252, 251, 250, 249, 248, 247,246];
    // for (let i = 0; i < 10; i++){
    //    console.log(tenNumber[i]);     
    // };
    // for (const iterator of tenNumber) {
    //  console.log(iterator);  
    // }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
    // let TenString = ["akt", "git", "php", 'js', "html","dOBBI", "react", "Angular"];
    // for (let i =0; i < 10; i++){
    //     console.log(TenString[i]);
    // }
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
    // for (let i = 0; i < StringNumBool.length; i++) {
    //     console.log(StringNumBool[i]);
        
    // }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
    // for (let i = 0; i < StringNumBool.length; i++) {
    //     if (typeof StringNumBool[i] === "boolean")  {
    //         console.log(StringNumBool[i]);
    //     }
        
    // }
    
     //-------------з відео (за допомогою тернарного оператора)--------
//    let arr = [1,'2','textff',11,4,'5',6,null,false];
//    for (let i = 0; i < arr.length; i++) {
//        typeof arr[i] === 'boolean' ? console.log(arr[i]) : "error";
//    }

        // console.log(typeof (true)); typeof виводить тип в String
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// for (let i = 0; i < StringNumBool.length; i++) {
//     if (typeof(StringNumBool[i]) === "number")  {
//         console.log(StringNumBool[i]);
//     }
    
// }
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
    // for (let i = 0; i < StringNumBool.length; i++) {
    //     if (typeof(StringNumBool[i]) == "string") console.log(StringNumBool[i])
    // };
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
    // let pustuiyarray = [];
    // pustuiyarray[0] = 5;
    // pustuiyarray[1] = NaN;
    // pustuiyarray[2] = undefined;
    // pustuiyarray[3] = {ad:false};
    // pustuiyarray[4] = ["faaf", 1, true];
    // pustuiyarray[5] = "java";
    // pustuiyarray[6] = "Python";
    // pustuiyarray[7] = false;
    // pustuiyarray[8] = Symbol('q');
    // pustuiyarray[9] = null;
    // console.log(pustuiyarray);
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
    // for (let i = 0; i < 10; i++) {
    //     console.log(i);
    //     document.write(`<div>${i}</div>`);
    // }
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
    // for (let i = 0; i < 100; i++){
    //     console.log(i);
    //     document.write(i);
    // }
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
    // for (let i = 0; i < 200; i += 2) {
    //     console.log(i);
    //     document.write(`step- ${i} <br>`);
    // }
// // - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
    // for(let i = 0; i < 200; i++){
    //     if(i % 2 == 0) {
    //     console.log(i);
    //     document.write(`step- ${i} <br>`);
    //     }
    // }
    // console.log(10 % 2); парне є те число яке ділиться на 2 без остачі!!!!!!
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

//     for (let i = 0; i < 200; i++){
//         if(i % 2 !== 0){
//             console.log(i);
//             document.write(`step- ${i} <br>`);
//         };
//     };
    // -----------------таймер швидкості виконання частини коду--------------------------
//     let time = performance.now();
//     // некий код
//     time = performance.now() - time;
//     console.log('Время выполнения = ', time);
// -----------------------------------------------------------
// // ______________________________________________________________________________________________________________________________________________________
//                                                                 РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________


// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

    // let TestArr = ['a', 'b', 'c'];
    //  for(i = 1; i < 4; i++){
    //      TestArr.push(i)
    //  };
    // console.log(TestArr);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

    // let TestArr = [1, 2, 3];
    // let NewTestArr = [];
    //     for(i = TestArr.length - 1 ; i >= 0; i--){
    //         NewTestArr.push(TestArr[i]);
    //     }
    //     console.log(NewTestArr);
         
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
    // let TestArr = [1, 2, 3];
    //     for(i = 4; i <= 6; i++) TestArr.push(i);
    //     console.log(TestArr);
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
    // let TestArr = [1, 2, 3];
    // for(i = 6; i >= 4; i--) TestArr.unshift(i);
    // console.log(TestArr);
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
    // let StrArr = ['js', 'css', 'jq'];
        // console.log(StrArr.shift());
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
    // console.log(StrArr.pop());
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
    // let NumArr= [1, 2, 3, 4, 5];
    // console.log(NumArr.splice(3));
  
    // -------------------------------------
    // let NewNumArr = [];
    //  for(i = 0; i < 2; i++){
    //    NewNumArr.unshift(NumArr.pop());
    // };
    // console.log(NewNumArr);
//----------------------------------

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
    // let NumArr= [1, 2, 3, 4, 5];
    // console.log(NumArr.splice(0, 2));
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри
 // Потім дописати
    // let TestArr = [1, 2, 3, 4, 5];
    // let NewTestArr =[];
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// let NewTestar = [2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while
    // let i = 0;
    // while (i < NewTestar.length) {
    //     console.log(NewTestar[i]);
    //     i++;
    // }
   
// 2. перебрати його циклом for
    // for (let i = 0; i < NewTestar.length; i++){
    //      console.log(NewTestar[i]);
    // };

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
    //  let i = 0;
    //  while (i < NewTestar.length) {
    //      if (i % 2 !== 0){console.log(NewTestar[i])};
    //   i++   
    //  }
    // console.log("------------------------------------");
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
    // for (let i = 0; i < NewTestar.length; i++){
    //     if(i % 2 !== 0){console.log(NewTestar[i]);}
    // };

// 5. перебрати циклом while та вивести  числа тільки парні  значення
        // let i = 0;
        // while (i < NewTestar.length) {
        //         if(NewTestar[i] % 2 == 0)console.log(NewTestar[i]);;
        //     i++;
        // }
// 6. перебрати циклом for та вивести  числа тільки парні  значення
    // for (let i = 0; i < NewTestar.length; i++) {
    //         if (NewTestar[i] % 2 == 0)console.log(NewTestar[i]);
        
    // };
// 7. замінити кожне число кратне 3 на слово "okten"
    //  for (let i = 0; i < NewTestar.length; i++) {
    //      if(NewTestar[i] % 3 === 0 ) NewTestar[i] = 'okten';
    //      console.log(NewTestar[i]);
        
    //  };
// 8. вивести масив в зворотньому порядку.
    // for (let i = NewTestar.length - 1; i >= 0; i--) { 
    //     console.log(NewTestar[i]);
        
    // }
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10.
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
    // let TestFifthy = [];
    // let TestFifthy1 = [];
    // for (let i = 0; i < 100; i++) {
    //     if ( i % 2 === 0)TestFifthy.push(i);
    //     if ( i % 2 !== 0)TestFifthy1.push(i);
        
        
    // };
    // console.log(TestFifthy);

    // console.log(TestFifthy1);



// 1. Створити пустий масив та :
//        a. заповнити його 50 парними числами за допомоги циклу.
//        b. заповнити його 50 непарними числами за допомоги циклу.
//        c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
    // let Testarray = [];
    // for (let i = 0; i < 20; i++) {
    //      Testarray.push(Math.floor(Math.random() * 100));
        
    // }
    // console.log(Testarray);
//        d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
    let Testarray = [];
    for (let i = 0; i < 20; i++) {
         Testarray.push(Math.floor(Math.random() * (732 - 8) ) + 8);
        
    }
    console.log(Testarray);
//  2. Вивести за допомогою console.log кожен третій елемен
//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//  5. Вивести кожен елемент масиву, сусід справа якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.

//  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.




// ______________________________________________________________________________________________________________________________________________________
//                                                                     Додатково
// ______________________________________________________________________________________________________________________________________________________

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години  (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

 